import Typography from "@mui/material/Typography";

function WikiPishehIntro() {
  return (
    <>
      <Typography gutterBottom align="justify">
        حدود سی سال پیش، آقای شهرداد میرزایی فعالیت خود را برای ثبت اصطلاحات پیشه‌ها را شروع کرد. اولین نتایج در همان
        دههء هفتاد با عنوان فرهنگ دوزندگی و کفشگری منتشر شد. این کار پس از آن هم با کمک گرفتن از پژوهشگران مختلف ادامه
        یافت. تا تابستان ۱۴۰۱ پژوهش‌های مرتبط با ۱۰ پیشه نهایی شده بود و پژوهش ۹ دفتر دیگر هم کمابیش در حال انجام
        بود. مدیریت جدید فرهنگ پیشه‌ها، در نیمهٔ دوم سال ۱۴۰۱، از مکتوب کردن شیوه‌نامهء این فعالیت با تأکید بر همان
        ایدهء اولیه و آماده‌سازی داده‌ها برای انتشار برخط شروع شد و از تابستان ۱۴۰۲ «<strong>سامانه داده
        پیشه‌ها</strong>»، به‌اختصار «سادا»، برای بهره‌برداری نهایی آماده شد. از آن پس پژوهش و ثبت داده، و نیز ویرایش
        آن‌ها، بر مبنای شیوه‌نامه، برخط انجام می‌شود. اواسط سال ۱۴۰۲ ایدهء ویکی‌پیشه مطرح و سند فنی مشخصات آن تهیه شد.
        در بهار ۱۴۰۳ وبگاه ویکی‌پیشه در اختیار دست‌اندرکاران این فعالیت قرار گرفت تا اشکال‌های موجود را شناسایی و در حد
        امکان رفع کنند.
      </Typography>
      <Typography gutterBottom align="justify">
        واژگان پیشه‌ها، به‌ویژه پیشه‌های مهجور، در زبان فارسی نقش مهمی در حفظ میراث فرهنگی زبان فارسی و واژه‌گزینی دارد.
        ورود فناوری‌های نو در بسیاری از پیشه‌ها هم به تهاجم واژگانی منجر شده و بیم آن می‌رود که واژگان مصطلح پیشه‌ها را
        که در طول زمان خلق شده‌ در معرض نابودی و فراموشی قرار دهد. سازمان‌های رسمی مسئول در حفظ و گسترش زبان فارسی هم
        بیشتر به زبان معیار می پردازند و کمتر به زبان پیشه‌ها و زبان کوچه توجه دارند؛ جنبه‌های گوناگون فرهنگ شفاهیِ پیشه
        هم بخش دیگری از این فرهنگ است که از آن معمولاً غفلت می‌شود. این است‌ که شناخت و ثبت واژگان پیشه‌های مختلف اهمیت
        بسیار در حفظ غنای زبان فارسی و حفظ پویایی آن دارد. این مجموعه پژوهش‌ها راهی است برای حفظ زبان فارسی و فرهنگ مردم
        کوچه که حالا با رونمایی از ویکی‌پیشه امیدواریم همگان در بالندگی و تصحیح آن شریک شوند.
      </Typography>
      <Typography gutterBottom align="justify">
        <strong>ویکی‌پیشه</strong> اکنون حدود ۲۳۰۰۰ مدخل دارد و در دسترس همگان است. این پایگاه داده‌ برخی قابلیت‌های
        مرسوم ویکی‌ها، از جمله جستجو و اضافه کردن اطلاعات را دارد. ویکی‌پیشه نه تنها امکان دسترسی همگانی به داده‌های
        پژوهش شده را فراهم کرده، بلکه محیطی است برای تصحیح و تکمیلِ برخط بدون محدودیت از طرف هر علاقه‌مند به زبان و
        فرهنگ و رشد پیشه‌ها در کشور از هر جا. این سامانه برخط با به‌کارگیری فناوری‌های جدید و آماده شدن برای حضور در
        صحنهء جهانی، پذیرش هوش مصنوعی مبتنی بر مدل‌های بزرگ زبانی (LLM) و کمک به حضور و بالندگی زبان فارسی در عرصه جهانی
        امکان هر گونه استفادهء زبانی و گسترش ثبت دادهء پیشه‌ها را بدون محدودیت زمانی و جغرافیایی فراهم می‌کند و شما
        به‌راحتی می‌توانید عضوی از این کار باشید، پس لطفاً در این فعالیت فرهنگی مشارکت کنید.
      </Typography>
      <Typography gutterBottom align="justify">
        در این مجموعه، هر مدخل علاوه‌بر اطلاعات لازم واژگانی، به تفکیک پیشه‌ها، بخش‌های مختلف از جمله تعریف، وندها،
        واج‌نگاری، مترادف و متضاد، عکس، فیلم، و اطلاعات تکمیلی پژوهش‌شده در دسترس است. حامی مالی این مجموعه
        تاکنون <strong>بنیاد کوچه</strong> و <strong>انتشارات دیبایه/ فرهنگان</strong> بوده است. محدودیت اصلی گسترش این
        فعالیت هم کمبود منابع مالی است که امید می‌رود نهادهای خصوصی و دولتی در کشور، با حمایت و استفاده از این امکان
        فراهم‌شده، به گسترش این فعالیتِ زیربنایی برای حفظ و پویایی زبان فارسی و فرهنگ ایرانی کمک کنند.
      </Typography>
    </>
  );
}

export default WikiPishehIntro;